MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_interrupts.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/*****************************************************************************/
/** \file hc32f46x_interrupts.c
 **
 ** A detailed description is available at
 ** @link InterruptGroup Interrupt description @endlink
 **
 **   - 2018-10-12  1.0  Zhangxl First version for Device Driver Library of
 **     interrupt.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_interrupts.h"
#include "hc32f46x_utility.h"
#include "board_tim0.h"

#if (DDL_INTERRUPTS_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup InterruptGroup
 ******************************************************************************/
//@{
// extern void SysTickIrq_Handler(void);

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*! Parameter validity check for null pointer. */
#define IS_NULL_POINT(x) (NULL != (x))

/*! Parameter validity check for valid wakeup source from stop mode. */
#define IS_VALID_WKUP_SRC(x)     \
    (((x) == INT_USART1_WUPI) || \
     ((x) == INT_TMR01_GCMA) ||  \
     ((x) == INT_RTC_ALM) ||     \
     ((x) == INT_RTC_PRD) ||     \
     ((x) == INT_WKTM_PRD) ||    \
     ((x) == INT_ACMP1) ||       \
     ((x) == INT_PVD_PVD1) ||    \
     ((x) == INT_PVD_PVD2) ||    \
     ((x) == INT_SWDT_REFUDF) || \
     ((x) == INT_PORT_EIRQ0) ||  \
     ((x) == INT_PORT_EIRQ1) ||  \
     ((x) == INT_PORT_EIRQ2) ||  \
     ((x) == INT_PORT_EIRQ3) ||  \
     ((x) == INT_PORT_EIRQ4) ||  \
     ((x) == INT_PORT_EIRQ5) ||  \
     ((x) == INT_PORT_EIRQ6) ||  \
     ((x) == INT_PORT_EIRQ7) ||  \
     ((x) == INT_PORT_EIRQ8) ||  \
     ((x) == INT_PORT_EIRQ9) ||  \
     ((x) == INT_PORT_EIRQ10) || \
     ((x) == INT_PORT_EIRQ11) || \
     ((x) == INT_PORT_EIRQ12) || \
     ((x) == INT_PORT_EIRQ13) || \
     ((x) == INT_PORT_EIRQ14) || \
     ((x) == INT_PORT_EIRQ15))

/*! Max IRQ Handler. */
#define IRQ_NUM_MAX (128u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
func_ptr_t IrqHandler[IRQ_NUM_MAX] = {NULL};
#ifdef __cplusplus
extern "C"
{
#endif

    /**
     *******************************************************************************
     ** \brief IRQ Registration
     **
     ** param [in]                          pstcIrqRegiConf, IRQ registration
     **                                     configure structure
     **
     ** retval                              Ok, IRQ register successfully.
     **                                     ErrorInvalidParameter, IRQ No. and
     **                                     Vector No. are not match.
     **                                     ErrorUninitialized, Make sure the
     **                                     Interrupt select register (INTSEL) is
     **                                     default value (0x1FFu) before setting.
     **
     *****************************************************************************/
    en_result_t enIrqRegistration(const stc_irq_regi_conf_t *pstcIrqRegiConf)
    {
        // todo, assert ...
        stc_intc_sel_field_t *stcIntSel;
        en_result_t enRet = Ok;

        // DDL_ASSERT(NULL != pstcIrqRegiConf->pfnCallback);
        DDL_ASSERT(IS_NULL_POINT(pstcIrqRegiConf->pfnCallback));

        /* IRQ032~127 whether out of range */
        if (((((pstcIrqRegiConf->enIntSrc / 32) * 6 + 32) > pstcIrqRegiConf->enIRQn) ||
             (((pstcIrqRegiConf->enIntSrc / 32) * 6 + 37) < pstcIrqRegiConf->enIRQn)) &&
            (pstcIrqRegiConf->enIRQn >= 32))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(&M4_INTC->SEL0) +
                                                 (4u * pstcIrqRegiConf->enIRQn));
            if (0x1FFu == stcIntSel->INTSEL)
            {
                stcIntSel->INTSEL = pstcIrqRegiConf->enIntSrc;
                IrqHandler[pstcIrqRegiConf->enIRQn] = pstcIrqRegiConf->pfnCallback;
            }
            else
            {
                enRet = ErrorUninitialized;
            }
        }
        return enRet;
    }

    /**
     *******************************************************************************
     ** \brief IRQ Resign
     **
     ** param [in]                          enIRQn, IRQ enumunation (Int000_IRQn ~
     **                                     Int127_IRQn
     **
     ** retval                              Ok, IRQ resign sucessfully.
     **                                     ErrorInvalidParameter, IRQ No. is out
     **                                     of range
     **
     *****************************************************************************/
    en_result_t enIrqResign(IRQn_Type enIRQn)
    {
        stc_intc_sel_field_t *stcIntSel;
        en_result_t enRet = Ok;

        if ((enIRQn < Int000_IRQn) || (enIRQn > Int127_IRQn))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(&M4_INTC->SEL0) + (4ul * enIRQn));
            stcIntSel->INTSEL = 0x1FFu;
            IrqHandler[enIRQn] = NULL;
        }
        return enRet;
    }

    /**
     *******************************************************************************
     ** \brief Share IRQ handler enable
     **
     ** param [in]                          enIntSrc, interrupt souce, This parameter
     **                                     can be any value of @ref en_int_src_t
     **
     ** retval                              Ok
     **
     ******************************************************************************/
    en_result_t enShareIrqEnable(en_int_src_t enIntSrc)
    {
        uint32_t *VSSELx;

        // todo assert

        VSSELx = (uint32_t *)(((uint32_t)&M4_INTC->VSSEL128) + (4u * (enIntSrc / 32u)));
        *VSSELx |= (uint32_t)(1ul << (enIntSrc & 0x1Fu));

        return Ok;
    }

    /**
     *******************************************************************************
     ** \brief Share IRQ handler disable
     **
     ** param [in]                          enIntSrc, interrupt souce, This parameter
     **                                     can be any value of @ref en_int_src_t
     **
     ** retval                              Ok
     **
     ******************************************************************************/
    en_result_t enShareIrqDisable(en_int_src_t enIntSrc)
    {
        uint32_t *VSSELx;

        // todo assert

        VSSELx = (uint32_t *)(((uint32_t)&M4_INTC->VSSEL128) + (4u * (enIntSrc / 32u)));
        *VSSELx &= ~(uint32_t)(1ul << (enIntSrc & 0x1Fu));

        return Ok;
    }

    /**
     *******************************************************************************
     ** \brief Enable stop mode wakeup source
     **
     ** param [in]                          u32WakeupSrc, This parameter can be any
     **                                     composed value of @ref en_int_wkup_src_t
     **
     ** retval                              Ok, corresponding wakeup source be enabled
     **                                     ErrorInvalidParameter, parameter with
     **                                     non-definition bits
     **
     ******************************************************************************/
    en_result_t enIntWakeupEnable(uint32_t u32WakeupSrc)
    {
        en_result_t enRet = Ok;
        if (0ul != (u32WakeupSrc & 0xFD000000ul))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            M4_INTC->WUPEN |= u32WakeupSrc;
        }
        return enRet;
    }

    /**
     *******************************************************************************
     ** \brief Disable stop mode wakeup source
     **
     ** param [in]                          u32WakeupSrc, This parameter can be any
     **                                     composed value of @ref en_int_wkup_src_t
     **
     ** retval                              Ok, corresponding wakeup source be disabled
     **                                     ErrorInvalidParameter, parameter with
     **                                     non-definition bits
     **
     ******************************************************************************/
    en_result_t enIntWakeupDisable(uint32_t u32WakeupSrc)
    {
        en_result_t enRet = Ok;
        if (0ul != (u32WakeupSrc & 0xFD000000u))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            M4_INTC->WUPEN &= ~u32WakeupSrc;
        }
        return enRet;
    }

    /**
     *******************************************************************************
     ** \brief Event enable
     **
     ** param [in]                          u32Event, This parameter can be
     **                                     any composed value of @ref en_evt_t
     **
     ** retval                              Ok, corresponding event Ch. be enabled
     **
     ******************************************************************************/
    en_result_t enEventEnable(uint32_t u32Event)
    {
        M4_INTC->EVTER |= u32Event;
        return Ok;
    }

    /**
     *******************************************************************************
     ** \brief Event enable
     **
     ** param [in]                          u32Event, This parameter can be
     **                                     any composed value of @ref en_evt_t
     **
     ** retval                              Ok, corresponding event Ch. be disabled
     **
     ******************************************************************************/
    en_result_t enEventDisable(uint32_t u32Event)
    {
        M4_INTC->EVTER &= ~u32Event;
        return Ok;
    }

    /**
     *******************************************************************************
     ** \brief Interrupt enable
     **
     *  param [in]                          u32Int, This parameter can be any composed
     *                                      value of @ref en_int_t
     **
     ** retval                              Ok, corresponding interrupt vector be enabled
     **
     ******************************************************************************/
    en_result_t enIntEnable(uint32_t u32Int)
    {
        M4_INTC->IER |= u32Int;
        return Ok;
    }

    /**
     *******************************************************************************
     ** \brief Interrupt disable
     **
     *  param [in]                          u32Int, This parameter can be any composed
     *                                      value of @ref en_int_t
     **
     ** retval                              Ok, corresponding interrupt vector be disabled
     **
     ******************************************************************************/
    en_result_t enIntDisable(uint32_t u32Int)
    {
        M4_INTC->IER &= ~u32Int;
        return Ok;
    }

    /**
     *******************************************************************************
     ** \brief NMI IRQ handler
     **
     ******************************************************************************/
    void NMI_Handler(void)
    {
        NMI_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief Hard Fault IRQ handler
     **
     ******************************************************************************/
    void HardFault_Handler(void)
    {
        HardFault_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief MPU Fault IRQ handler
     **
     ******************************************************************************/
    void MemManage_Handler(void)
    {
        MemManage_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief Bus Fault IRQ handler
     **
     ******************************************************************************/
    void BusFault_Handler(void)
    {
        BusFault_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief Usage Fault IRQ handler
     **
     ******************************************************************************/
    void UsageFault_Handler(void)
    {
        UsageFault_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief SVCall IRQ handler
     **
     ******************************************************************************/
    void SVC_Handler(void)
    {
        SVC_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief DebugMon IRQ handler
     **
     ******************************************************************************/
    void DebugMon_Handler(void)
    {
        DebugMon_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief PendSV IRQ handler
     **
     ******************************************************************************/
    void PendSV_Handler(void)
    {
        PendSV_IrqHandler();
    }

    /**
     *******************************************************************************
     ** \brief Systick IRQ handler
     **
     ******************************************************************************/
    void SysTick_Handler(void)
    {
        SysTickIrq_Handler();
    }

    /**
     *******************************************************************************
     ** \brief Int No.000 IRQ handler
     **
     ******************************************************************************/
    void IRQ000_Handler(void)
    {
        if (NULL != IrqHandler[Int000_IRQn])
        {
            IrqHandler[Int000_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.001 IRQ handler
     **
     ******************************************************************************/
    void IRQ001_Handler(void)
    {
        if (NULL != IrqHandler[Int001_IRQn])
        {
            IrqHandler[Int001_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.002 IRQ handler
     **
     ******************************************************************************/
    void IRQ002_Handler(void)
    {
        if (NULL != IrqHandler[Int002_IRQn])
        {
            IrqHandler[Int002_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.003 IRQ handler
     **
     ******************************************************************************/
    void IRQ003_Handler(void)
    {
        if (NULL != IrqHandler[Int003_IRQn])
        {
            IrqHandler[Int003_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.004 IRQ handler
     **
     ******************************************************************************/
    void IRQ004_Handler(void)
    {
        if (NULL != IrqHandler[Int004_IRQn])
        {
            IrqHandler[Int004_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.005 IRQ handler
     **
     ******************************************************************************/
    void IRQ005_Handler(void)
    {
        if (NULL != IrqHandler[Int005_IRQn])
        {
            IrqHandler[Int005_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.006 IRQ handler
     **
     ******************************************************************************/
    void IRQ006_Handler(void)
    {
        if (NULL != IrqHandler[Int006_IRQn])
        {
            IrqHandler[Int006_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.007 IRQ handler
     **
     ******************************************************************************/
    void IRQ007_Handler(void)
    {
        if (NULL != IrqHandler[Int007_IRQn])
        {
            IrqHandler[Int007_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.008 IRQ handler
     **
     ******************************************************************************/
    void IRQ008_Handler(void)
    {
        if (NULL != IrqHandler[Int008_IRQn])
        {
            IrqHandler[Int008_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.009 IRQ handler
     **
     ******************************************************************************/
    void IRQ009_Handler(void)
    {
        if (NULL != IrqHandler[Int009_IRQn])
        {
            IrqHandler[Int009_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.010 IRQ handler
     **
     ******************************************************************************/
    void IRQ010_Handler(void)
    {
        if (NULL != IrqHandler[Int010_IRQn])
        {
            IrqHandler[Int010_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.011 IRQ handler
     **
     ******************************************************************************/
    void IRQ011_Handler(void)
    {
        if (NULL != IrqHandler[Int011_IRQn])
        {
            IrqHandler[Int011_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.012 IRQ handler
     **
     ******************************************************************************/
    void IRQ012_Handler(void)
    {
        if (NULL != IrqHandler[Int012_IRQn])
        {
            IrqHandler[Int012_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.013 IRQ handler
     **
     ******************************************************************************/
    void IRQ013_Handler(void)
    {
        if (NULL != IrqHandler[Int013_IRQn])
        {
            IrqHandler[Int013_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.014 IRQ handler
     **
     ******************************************************************************/
    void IRQ014_Handler(void)
    {
        if (NULL != IrqHandler[Int014_IRQn])
        {
            IrqHandler[Int014_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.015 IRQ handler
     **
     ******************************************************************************/
    void IRQ015_Handler(void)
    {
        if (NULL != IrqHandler[Int015_IRQn])
        {
            IrqHandler[Int015_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.016 IRQ handler
     **
     ******************************************************************************/
    void IRQ016_Handler(void)
    {
        if (NULL != IrqHandler[Int016_IRQn])
        {
            IrqHandler[Int016_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.017 IRQ handler
     **
     ******************************************************************************/
    void IRQ017_Handler(void)
    {
        if (NULL != IrqHandler[Int017_IRQn])
        {
            IrqHandler[Int017_IRQn]();
        }
    }

