MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_interrupts.c
    /**
     *******************************************************************************
     ** \brief Int No.018 IRQ handler
     **
     ******************************************************************************/
    void IRQ018_Handler(void)
    {
        if (NULL != IrqHandler[Int018_IRQn])
        {
            IrqHandler[Int018_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.019 IRQ handler
     **
     ******************************************************************************/
    void IRQ019_Handler(void)
    {
        if (NULL != IrqHandler[Int019_IRQn])
        {
            IrqHandler[Int019_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.020 IRQ handler
     **
     ******************************************************************************/
    void IRQ020_Handler(void)
    {
        if (NULL != IrqHandler[Int020_IRQn])
        {
            IrqHandler[Int020_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.021 IRQ handler
     **
     ******************************************************************************/
    void IRQ021_Handler(void)
    {
        if (NULL != IrqHandler[Int021_IRQn])
        {
            IrqHandler[Int021_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.022 IRQ handler
     **
     ******************************************************************************/
    void IRQ022_Handler(void)
    {
        if (NULL != IrqHandler[Int022_IRQn])
        {
            IrqHandler[Int022_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.023 IRQ handler
     **
     ******************************************************************************/
    void IRQ023_Handler(void)
    {
        if (NULL != IrqHandler[Int023_IRQn])
        {
            IrqHandler[Int023_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.024 IRQ handler
     **
     ******************************************************************************/
    void IRQ024_Handler(void)
    {
        if (NULL != IrqHandler[Int024_IRQn])
        {
            IrqHandler[Int024_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.025 IRQ handler
     **
     ******************************************************************************/
    void IRQ025_Handler(void)
    {
        if (NULL != IrqHandler[Int025_IRQn])
        {
            IrqHandler[Int025_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.026 IRQ handler
     **
     ******************************************************************************/
    void IRQ026_Handler(void)
    {
        if (NULL != IrqHandler[Int026_IRQn])
        {
            IrqHandler[Int026_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.027 IRQ handler
     **
     ******************************************************************************/
    void IRQ027_Handler(void)
    {
        if (NULL != IrqHandler[Int027_IRQn])
        {
            IrqHandler[Int027_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.028 IRQ handler
     **
     ******************************************************************************/
    void IRQ028_Handler(void)
    {
        if (NULL != IrqHandler[Int028_IRQn])
        {
            IrqHandler[Int028_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.029 IRQ handler
     **
     ******************************************************************************/
    void IRQ029_Handler(void)
    {
        if (NULL != IrqHandler[Int029_IRQn])
        {
            IrqHandler[Int029_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.030 IRQ handler
     **
     ******************************************************************************/
    void IRQ030_Handler(void)
    {
        if (NULL != IrqHandler[Int030_IRQn])
        {
            IrqHandler[Int030_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.031 IRQ handler
     **
     ******************************************************************************/
    void IRQ031_Handler(void)
    {
        if (NULL != IrqHandler[Int031_IRQn])
        {
            IrqHandler[Int031_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.032 IRQ handler
     **
     ******************************************************************************/
    void IRQ032_Handler(void)
    {
        if (NULL != IrqHandler[Int032_IRQn])
        {
            IrqHandler[Int032_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.033 IRQ handler
     **
     ******************************************************************************/
    void IRQ033_Handler(void)
    {
        if (NULL != IrqHandler[Int033_IRQn])
        {
            IrqHandler[Int033_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.034 IRQ handler
     **
     ******************************************************************************/
    void IRQ034_Handler(void)
    {
        if (NULL != IrqHandler[Int034_IRQn])
        {
            IrqHandler[Int034_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.035 IRQ handler
     **
     ******************************************************************************/
    void IRQ035_Handler(void)
    {
        if (NULL != IrqHandler[Int035_IRQn])
        {
            IrqHandler[Int035_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.036 IRQ handler
     **
     ******************************************************************************/
    void IRQ036_Handler(void)
    {
        if (NULL != IrqHandler[Int036_IRQn])
        {
            IrqHandler[Int036_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.037 IRQ handler
     **
     ******************************************************************************/
    void IRQ037_Handler(void)
    {
        if (NULL != IrqHandler[Int037_IRQn])
        {
            IrqHandler[Int037_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.038 IRQ handler
     **
     ******************************************************************************/
    void IRQ038_Handler(void)
    {
        if (NULL != IrqHandler[Int038_IRQn])
        {
            IrqHandler[Int038_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.039 IRQ handler
     **
     ******************************************************************************/
    void IRQ039_Handler(void)
    {
        if (NULL != IrqHandler[Int039_IRQn])
        {
            IrqHandler[Int039_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.040 IRQ handler
     **
     ******************************************************************************/
    void IRQ040_Handler(void)
    {
        if (NULL != IrqHandler[Int040_IRQn])
        {
            IrqHandler[Int040_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.041 IRQ handler
     **
     ******************************************************************************/
    void IRQ041_Handler(void)
    {
        if (NULL != IrqHandler[Int041_IRQn])
        {
            IrqHandler[Int041_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.042 IRQ handler
     **
     ******************************************************************************/
    void IRQ042_Handler(void)
    {
        if (NULL != IrqHandler[Int042_IRQn])
        {
            IrqHandler[Int042_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.043 IRQ handler
     **
     ******************************************************************************/
    void IRQ043_Handler(void)
    {
        if (NULL != IrqHandler[Int043_IRQn])
        {
            IrqHandler[Int043_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.044 IRQ handler
     **
     ******************************************************************************/
    void IRQ044_Handler(void)
    {
        if (NULL != IrqHandler[Int044_IRQn])
        {
            IrqHandler[Int044_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.045 IRQ handler
     **
     ******************************************************************************/
    void IRQ045_Handler(void)
    {
        if (NULL != IrqHandler[Int045_IRQn])
        {
            IrqHandler[Int045_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.046 IRQ handler
     **
     ******************************************************************************/
    void IRQ046_Handler(void)
    {
        if (NULL != IrqHandler[Int046_IRQn])
        {
            IrqHandler[Int046_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.047 IRQ handler
     **
     ******************************************************************************/
    void IRQ047_Handler(void)
    {
        if (NULL != IrqHandler[Int047_IRQn])
        {
            IrqHandler[Int047_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.048 IRQ handler
     **
     ******************************************************************************/
    void IRQ048_Handler(void)
    {
        if (NULL != IrqHandler[Int048_IRQn])
        {
            IrqHandler[Int048_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.049 IRQ handler
     **
     ******************************************************************************/
    void IRQ049_Handler(void)
    {
        if (NULL != IrqHandler[Int049_IRQn])
        {
            IrqHandler[Int049_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.050 IRQ handler
     **
     ******************************************************************************/
    void IRQ050_Handler(void)
    {
        if (NULL != IrqHandler[Int050_IRQn])
        {
            IrqHandler[Int050_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.051 IRQ handler
     **
     ******************************************************************************/
    void IRQ051_Handler(void)
    {
        if (NULL != IrqHandler[Int051_IRQn])
        {
            IrqHandler[Int051_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.052 IRQ handler
     **
     ******************************************************************************/
    void IRQ052_Handler(void)
    {
        if (NULL != IrqHandler[Int052_IRQn])
        {
            IrqHandler[Int052_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.053 IRQ handler
     **
     ******************************************************************************/
    void IRQ053_Handler(void)
    {
        if (NULL != IrqHandler[Int053_IRQn])
        {
            IrqHandler[Int053_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.054 IRQ handler
     **
     ******************************************************************************/
    void IRQ054_Handler(void)
    {
        if (NULL != IrqHandler[Int054_IRQn])
        {
            IrqHandler[Int054_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.055 IRQ handler
     **
     ******************************************************************************/
    void IRQ055_Handler(void)
    {
        if (NULL != IrqHandler[Int055_IRQn])
        {
            IrqHandler[Int055_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.056 IRQ handler
     **
     ******************************************************************************/
    void IRQ056_Handler(void)
    {
        if (NULL != IrqHandler[Int056_IRQn])
        {
            IrqHandler[Int056_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.057 IRQ handler
     **
     ******************************************************************************/
    void IRQ057_Handler(void)
    {
        if (NULL != IrqHandler[Int057_IRQn])
        {
            IrqHandler[Int057_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.058 IRQ handler
     **
     ******************************************************************************/
    void IRQ058_Handler(void)
    {
        if (NULL != IrqHandler[Int058_IRQn])
        {
            IrqHandler[Int058_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.059 IRQ handler
     **
     ******************************************************************************/
    void IRQ059_Handler(void)
    {
        if (NULL != IrqHandler[Int059_IRQn])
        {
            IrqHandler[Int059_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.060 IRQ handler
     **
     ******************************************************************************/
    void IRQ060_Handler(void)
    {
        if (NULL != IrqHandler[Int060_IRQn])
        {
            IrqHandler[Int060_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.061 IRQ handler
     **
     ******************************************************************************/
    void IRQ061_Handler(void)
    {
        if (NULL != IrqHandler[Int061_IRQn])
        {
            IrqHandler[Int061_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.062 IRQ handler
     **
     ******************************************************************************/
    void IRQ062_Handler(void)
    {
        if (NULL != IrqHandler[Int062_IRQn])
        {
            IrqHandler[Int062_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.063 IRQ handler
     **
     ******************************************************************************/
    void IRQ063_Handler(void)
    {
        if (NULL != IrqHandler[Int063_IRQn])
        {
            IrqHandler[Int063_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.064 IRQ handler
     **
     ******************************************************************************/
    void IRQ064_Handler(void)
    {
        if (NULL != IrqHandler[Int064_IRQn])
        {
            IrqHandler[Int064_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.065 IRQ handler
     **
     ******************************************************************************/
    void IRQ065_Handler(void)
    {
        if (NULL != IrqHandler[Int065_IRQn])
        {
            IrqHandler[Int065_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.066 IRQ handler
     **
     ******************************************************************************/
    void IRQ066_Handler(void)
    {
        if (NULL != IrqHandler[Int066_IRQn])
        {
            IrqHandler[Int066_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.067 IRQ handler
     **
     ******************************************************************************/
    void IRQ067_Handler(void)
    {
        if (NULL != IrqHandler[Int067_IRQn])
        {
            IrqHandler[Int067_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.068 IRQ handler
     **
     ******************************************************************************/
    void IRQ068_Handler(void)
    {
        if (NULL != IrqHandler[Int068_IRQn])
        {
            IrqHandler[Int068_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.069 IRQ handler
     **
     ******************************************************************************/
    void IRQ069_Handler(void)
    {
        if (NULL != IrqHandler[Int069_IRQn])
        {
            IrqHandler[Int069_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.070 IRQ handler
     **
     ******************************************************************************/
    void IRQ070_Handler(void)
    {
        if (NULL != IrqHandler[Int070_IRQn])
        {
            IrqHandler[Int070_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.071 IRQ handler
     **
     ******************************************************************************/
    void IRQ071_Handler(void)
    {
        if (NULL != IrqHandler[Int071_IRQn])
        {
            IrqHandler[Int071_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.072 IRQ handler
     **
     ******************************************************************************/
    void IRQ072_Handler(void)
    {
        if (NULL != IrqHandler[Int072_IRQn])
        {
            IrqHandler[Int072_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.073 IRQ handler
     **
     ******************************************************************************/
    void IRQ073_Handler(void)
    {
        if (NULL != IrqHandler[Int073_IRQn])
        {
            IrqHandler[Int073_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.074 IRQ handler
     **
     ******************************************************************************/
    void IRQ074_Handler(void)
    {
        if (NULL != IrqHandler[Int074_IRQn])
        {
            IrqHandler[Int074_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.075 IRQ handler
     **
     ******************************************************************************/
    void IRQ075_Handler(void)
    {
        if (NULL != IrqHandler[Int075_IRQn])
        {
            IrqHandler[Int075_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.076 IRQ handler
     **
     ******************************************************************************/
    void IRQ076_Handler(void)
    {
        if (NULL != IrqHandler[Int076_IRQn])
        {
            IrqHandler[Int076_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.077 IRQ handler
     **
     ******************************************************************************/
    void IRQ077_Handler(void)
    {
        if (NULL != IrqHandler[Int077_IRQn])
        {
            IrqHandler[Int077_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.078 IRQ handler
     **
     ******************************************************************************/
    void IRQ078_Handler(void)
    {
        if (NULL != IrqHandler[Int078_IRQn])
        {
            IrqHandler[Int078_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.079 IRQ handler
     **
     ******************************************************************************/
    void IRQ079_Handler(void)
    {
        if (NULL != IrqHandler[Int079_IRQn])
        {
            IrqHandler[Int079_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.080 IRQ handler
     **
     ******************************************************************************/
    void IRQ080_Handler(void)
    {
        if (NULL != IrqHandler[Int080_IRQn])
        {
            IrqHandler[Int080_IRQn]();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.081 IRQ handler
     **
     ******************************************************************************/
    void IRQ081_Handler(void)
    {
        if (NULL != IrqHandler[Int081_IRQn])
        {
            IrqHandler[Int081_IRQn]();
        }
    }

