MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_interrupts.c
        u32Tmp1 = M4_SPI1->CR1;
        u32Tmp2 = M4_SPI1->SR;
        /* SPI Ch.1 Receive completed */
        if ((u32Tmp1 & BIT_MASK_10) && (u32Tmp2 & BIT_MASK_07) && (VSSEL137 & BIT_MASK_11))
        {
            Spi1RxEnd_IrqHandler();
        }
        /* SPI Ch.1 Transmit buf empty */
        if ((u32Tmp1 & BIT_MASK_09) && (u32Tmp2 & BIT_MASK_05) && (VSSEL137 & BIT_MASK_12))
        {
            Spi1TxEmpty_IrqHandler();
        }
        /* SPI Ch.1 bus idle */
        if ((u32Tmp1 & BIT_MASK_11) && (!(u32Tmp2 & BIT_MASK_00)) && (VSSEL137 & BIT_MASK_13))
        {
            Spi1Idle_IrqHandler();
        }
        /* SPI Ch.1 parity/overflow/underflow/mode error */
        if ((u32Tmp1 & BIT_MASK_08) &&
            ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))) &&
            (VSSEL137 & BIT_MASK_14))
        {
            Spi1Err_IrqHandler();
        }

        u32Tmp1 = M4_SPI2->CR1;
        u32Tmp2 = M4_SPI2->SR;
        /* SPI Ch.2 Receive completed */
        if ((u32Tmp1 & BIT_MASK_10) && (u32Tmp2 & BIT_MASK_07) && (VSSEL137 & BIT_MASK_16))
        {
            Spi2RxEnd_IrqHandler();
        }
        /* SPI Ch.2 Transmit buf empty */
        if ((u32Tmp1 & BIT_MASK_09) && (u32Tmp2 & BIT_MASK_05) && (VSSEL137 & BIT_MASK_17))
        {
            Spi2TxEmpty_IrqHandler();
        }
        /* SPI Ch.2 bus idle */
        if ((u32Tmp1 & BIT_MASK_11) && (!(u32Tmp2 & BIT_MASK_00)) && (VSSEL137 & BIT_MASK_18))
        {
            Spi2Idle_IrqHandler();
        }
        /* SPI Ch.2 parity/overflow/underflow/mode error */
        if ((u32Tmp1 & BIT_MASK_08) &&
            ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))) &&
            (VSSEL137 & BIT_MASK_19))
        {
            Spi2Err_IrqHandler();
        }

        u32Tmp1 = M4_SPI3->CR1;
        u32Tmp2 = M4_SPI3->SR;
        /* SPI Ch.3 Receive completed */
        if ((u32Tmp1 & BIT_MASK_10) && (u32Tmp2 & BIT_MASK_07) && (VSSEL137 & BIT_MASK_21))
        {
            Spi3RxEnd_IrqHandler();
        }
        /* SPI Ch.3 Transmit buf empty */
        if ((u32Tmp1 & BIT_MASK_09) && (u32Tmp2 & BIT_MASK_05) && (VSSEL137 & BIT_MASK_22))
        {
            Spi3TxEmpty_IrqHandler();
        }
        /* SPI Ch.3 bus idle */
        if ((u32Tmp1 & BIT_MASK_11) && (!(u32Tmp2 & BIT_MASK_00)) && (VSSEL137 & BIT_MASK_23))
        {
            Spi3Idle_IrqHandler();
        }
        /* SPI Ch.3 parity/overflow/underflow/mode error */
        if ((u32Tmp1 & BIT_MASK_08) &&
            ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))) &&
            (VSSEL137 & BIT_MASK_24))
        {
            Spi3Err_IrqHandler();
        }

        u32Tmp1 = M4_SPI4->CR1;
        u32Tmp2 = M4_SPI4->SR;
        /* SPI Ch.4 Receive completed */
        if ((u32Tmp1 & BIT_MASK_10) && (u32Tmp2 & BIT_MASK_07) && (VSSEL137 & BIT_MASK_26))
        {
            Spi4RxEnd_IrqHandler();
        }
        /* SPI Ch.4 Transmit buf empty */
        if ((u32Tmp1 & BIT_MASK_09) && (u32Tmp2 & BIT_MASK_05) && (VSSEL137 & BIT_MASK_27))
        {
            Spi4TxEmpty_IrqHandler();
        }
        /* SPI Ch.4 bus idle */
        if ((u32Tmp1 & BIT_MASK_11) && (!(u32Tmp2 & BIT_MASK_00)) && (VSSEL137 & BIT_MASK_28))
        {
            Spi4Idle_IrqHandler();
        }
        /* SPI Ch.4 parity/overflow/underflow/mode error */
        if ((u32Tmp1 & BIT_MASK_08) &&
            ((u32Tmp2 & (BIT_MASK_00 | BIT_MASK_02 | BIT_MASK_03 | BIT_MASK_04))) &&
            (VSSEL137 & BIT_MASK_29))
        {
            Spi4Err_IrqHandler();
        }
    }

    /**
     *******************************************************************************
     ** \brief Int No.138 share IRQ handler
     **
     ******************************************************************************/
    void IRQ138_Handler(void)
    {
        uint32_t u32Tmp1 = 0u;
        uint32_t VSSEL138 = M4_INTC->VSSEL138;

        u32Tmp1 = M4_TMR41->OCSRU;
        /* Timer4 Ch.1 U phase higher compare match */
        if ((VSSEL138 & BIT_MASK_00) && (u32Tmp1 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_06))
        {
            Timer41GCMUH_IrqHandler();
        }
        /* Timer4 Ch.1 U phase lower compare match */
        if ((VSSEL138 & BIT_MASK_01) && (u32Tmp1 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_07))
        {
            Timer41GCMUL_IrqHandler();
        }

        u32Tmp1 = M4_TMR41->OCSRV;
        /* Timer4 Ch.1 V phase higher compare match */
        if ((VSSEL138 & BIT_MASK_02) && (u32Tmp1 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_06))
        {
            Timer41GCMVH_IrqHandler();
        }
        /* Timer4 Ch.1 V phase lower compare match */
        if ((VSSEL138 & BIT_MASK_03) && (u32Tmp1 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_07))
        {
            Timer41GCMVL_IrqHandler();
        }

        u32Tmp1 = M4_TMR41->OCSRW;
        /* Timer4 Ch.1 W phase higher compare match */
        if ((VSSEL138 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_06))
        {
            Timer41GCMWH_IrqHandler();
        }
        /* Timer4 Ch.1 W phase lower compare match */
        if ((VSSEL138 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_07))
        {
            Timer41GCMWL_IrqHandler();
        }

        u32Tmp1 = M4_TMR41->CCSR;
        /* Timer4 Ch.1 overflow */
        if ((VSSEL138 & BIT_MASK_06) && (u32Tmp1 & BIT_MASK_08) && (u32Tmp1 & BIT_MASK_09))
        {
            Timer41GOV_IrqHandler();
        }
        /* Timer4 Ch.1 underflow */
        if ((VSSEL138 & BIT_MASK_07) && (u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_14))
        {
            Timer41GUD_IrqHandler();
        }

        u32Tmp1 = M4_TMR41->RCSR;
        /* Timer4 Ch.1 U phase reload */
        if ((VSSEL138 & BIT_MASK_08) && (~(u32Tmp1 & BIT_MASK_00)) && (u32Tmp1 & BIT_MASK_04))
        {
            Timer41ReloadU_IrqHandler();
        }
        /* Timer4 Ch.1 V phase reload */
        if ((VSSEL138 & BIT_MASK_09) && (~(u32Tmp1 & BIT_MASK_01)) && (u32Tmp1 & BIT_MASK_08))
        {
            Timer41ReloadV_IrqHandler();
        }
        /* Timer4 Ch.1 W phase reload */
        if ((VSSEL138 & BIT_MASK_10) && (~(u32Tmp1 & BIT_MASK_02)) && (u32Tmp1 & BIT_MASK_12))
        {
            Timer41ReloadW_IrqHandler();
        }

